<a href="https://colab.research.google.com/github/Astem-Grey/start/blob/line1/lesson_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# NumPy

### Задание №1

In [ ]:
import numpy as np

In [ ]:
a = np.array([[1, 6], [2, 8], [3, 11], [3, 10], [1, 7]])
a.mean(axis=0, dtype=float)

array([2. , 8.4])

### Задание №2

In [ ]:
a_centered = a - a.mean(axis=0)
a_centered

array([[-1. , -2.4],
       [ 0. , -0.4],
       [ 1. ,  2.6],
       [ 1. ,  1.6],
       [-1. , -1.4]])

### Задание №3

In [ ]:
N = a_centered.shape[0]
a_centered_sp = np.dot(a_centered[:, 0], a_centered[:, 1])
a_centered_sp / (N - 1)

2.0

### Задание №4

In [ ]:
m = np.transpose(a)
(np.cov(m))[0,1]

2.0

# Pandas

In [ ]:
import pandas as pd

### Задание №1

In [ ]:
z = {
    "author_id":[1, 2, 3],
    "author_name":['Тургенев', 'Чехов', 'Островкий']
}
author = pd.DataFrame(z)

book = pd.DataFrame(
    {
        'author_id':[1, 1, 1, 2, 2, 3, 3],
        'book_title':['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
        'price':[450, 300, 350, 500, 450, 370, 290]
    }
)

### Задание №2

In [ ]:
author_price = pd.merge(author, book, on = 'author_id')
author_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3   Островкий                 Гроза    370
6          3   Островкий  Таланты и поклонники    290

### Задание №3

In [ ]:
top5 = author_price.nlargest(5, 'price')
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3   Островкий              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

### Задание №4

In [ ]:
authorstat = pd.DataFrame(author_price.groupby(['author_name'])['price'].max())

authorstat

             price
author_name
Островкий      370
Тургенев       450
Чехов          500

In [ ]:
x = pd.DataFrame(author_price.groupby(['author_name'])['price'].min())
x

             price
author_name
Островкий      290
Тургенев       300
Чехов          450

In [ ]:
c = pd.DataFrame(author_price.groupby(['author_name'])['price'].mean())
c

                  price
author_name
Островкий    330.000000
Тургенев     366.666667
Чехов        475.000000

In [ ]:
authorstat['min_price'] = x['price']
authorstat['meam_price'] = c['price']
authorstat = authorstat.rename(columns = {'price' : 'max_price'})
authorstat

             max_price  min_price  meam_price
author_name
Островкий          370        290  330.000000
Тургенев           450        300  366.666667
Чехов              500        450  475.000000

Криво, не лаконично, и через одно место. Мне самому не понравилось.

In [ ]:
table_1 = pd.pivot_table(author_price, values = ['price'], index = ['author_name'], aggfunc = {'price': [max, min, np.mean]})
table_1

             price
               max        mean    min
author_name
Островкий    370.0  330.000000  290.0
Тургенев     450.0  366.666667  300.0
Чехов        500.0  475.000000  450.0

Переработал. Этот вариант мен больше нравится. Хотя и чуть-чуть не по заданию. Да и информации в уроке по такому варианту не было.

### Задание №5

In [ ]:
author_price['cover'] = ['твёрдая', 'мягкая', 'мягкая', 'твёрдая', 'твёрдая', 'мягкая', 'мягкая']
author_price

   author_id author_name            book_title  price    cover
0          1    Тургенев           Отцы и дети    450  твёрдая
1          1    Тургенев                 Рудин    300   мягкая
2          1    Тургенев     Дворянское гнездо    350   мягкая
3          2       Чехов      Толстый и тонкий    500  твёрдая
4          2       Чехов       Дама с собачкой    450  твёрдая
5          3   Островкий                 Гроза    370   мягкая
6          3   Островкий  Таланты и поклонники    290   мягкая

In [ ]:
book_info = pd.pivot_table(author_price, values = ['price'], index = ['author_name'], columns = ['cover'], aggfunc = np.sum, fill_value = 0)
book_info = book_info.rename(columns= {'price':''})
book_info

cover       мягкая твёрдая
author_name
Островкий      660       0
Тургенев       650     450
Чехов            0     950

In [ ]:
pd.to_pickle(book_info, "./book_info.pkl")

In [ ]:
book_info2 = pd.read_pickle("./book_info.pkl")
book_info2

cover       мягкая твёрдая
author_name
Островкий      660       0
Тургенев       650     450
Чехов            0     950